package main

import (
	"fmt"
	"strconv"
	"strings"
	"unicode"
	"unicode/utf8"
)

func main() {
	fmt.Println("Hello, VS Code!")

	// 练习1：
	//  编写代码分别定义一个整型、浮点型、布尔型、字符串型变量，使用fmt.Printf()搭配%T分别打印出上述变量的值和类型。
	var i int = 10
	var f float64 = 3.14
	var b bool = true
	var s string = "Hello!Go语言"
	fmt.Printf("变量i的值为：%v，类型为：%T\n", i, i)
	fmt.Printf("变量f的值为：%v，类型为：%T\n", f, f)
	fmt.Printf("变量b的值为：%v，类型为：%T\n", b, b)
	fmt.Printf("变量s的值为：%v，类型为：%T\n", s, s)
	//  编写代码统计出字符串"hello沙河小王子"中汉字的数量。
	str1 := "hello沙河小王子"
	count := 0
	len1 := utf8.RuneCountInString(str1)
	for _, ch := range str1 {
		if ch >= 0x4E00 && ch <= 0x9FA5 { // 汉字的Unicode编码范围,因为汉字类型是rune,rune代表unicode码点（每个字符都有对应的码点）
			count++
		}
	}
	fmt.Printf("字符串\"%s\"总字符数为：%d\n", str1, len1)
	fmt.Printf("字符串\"%s\"中汉字的数量为：%d\n", str1, count)

	//  计算字符串每个字符在UTF-8编码下占用的字节数
	for index, char := range str1 {
		// index:字符的起始字节索引
		// char:字符本身，类型是rune(int32)

		fmt.Printf("索引: %d, 字符: %c, 码点 (rune): %d, 字节数: %d\n",
			index,
			char,
			char,
			getByteSize(char))
	}

	// 练习2：
	// 从一个只有一个数字出现一次，其他数字都出现两次的数字字符串里面找出出现一次的数字
	str2 := "a52425b"
	singleNum, found := findSingleNumberInString_XOR(str2)
	if found {
		fmt.Printf("字符串\"%s\"中只出现一次的数字是：%d\n", str2, singleNum)
	} else {
		fmt.Printf("字符串\"%s\"中没有数字\n", str2)
	}

	str2_2 := "j6767898"
	singleNUm2, found2 := findSingleNumberInString_HashMap(str2_2)
	if found2 {
		fmt.Printf("字符串\"%s\"中只出现一次的数字是：%d\n", str2_2, singleNUm2)
	} else {
		fmt.Printf("字符串\"%s\"中没有只出现一次的数字\n", str2_2)
	}

	// 练习3：九九乘法表
	fmt.Println("--- 九九乘法表 (跳过含6的项) ---")
	// 调用函数来执行打印任务
	printMultiplicationTable_Skip6()
	fmt.Println("---------------------------------")

	// 练习4：找出数组中和为指定值的两个元素的下标
	nums4 := []int{1, 8, 3, 5, 7, 0, 8}
	target4 := 8
	fmt.Println("原始数组：", nums4)
	fmt.Println("目标和:", target4)
	pairs2 := findSumPairsHash(nums4, target4)
	if len(pairs2) > 0 {
		fmt.Println(pairs2) // 输出可能为 [[0 6] [1 5] [3 2]] 顺序不固定
	} else {
		fmt.Println("未找到任何组合。")
	}

	// 练习5：输出中英混合字符串中每个单词和汉字出现的次数（重点：单词累加器）
	text := "hello 世界， Hello world! 我爱我家，爱世界 I love my home"
	fmt.Println("原始字符串:")
	fmt.Println(text)
	wordCountsMap := countWordsAndChars(text)

	// 规范化输出结果
	fmt.Println("统计结果:")
	for item, count := range wordCountsMap {
		fmt.Printf("'%s':%d\n", item, count)
	}

}

// 练习1 辅助函数，计算一个rune在UTF-8编码下占用的字节数
func getByteSize(r rune) int {
	if r <= 0x7F {
		return 1
	} else if r <= 0x7FF {
		return 2
	} else if r <= 0xFFFF {
		return 3
	} else {
		return 4
	}
}

// 练习2 辅助函数，返回数字字符串里只出现一次的数字
// 首先是字典哈希表算法
func findSingleNumberInString_HashMap(s string) (int, bool) {
	countsmap := make(map[rune]int) //创建一个map来存储每个数字字符的出现次数，key是rune类型，value是int类型
	//遍历字符串中每一个rune
	for _, r := range s {
		if unicode.IsDigit(r) { //判断r是否是数字字符
			countsmap[r]++ //如果是数字字符，则在map中对应的key的value加1
		}
	}

	//遍历map，找到只出现一次的数字字符
	for r, count := range countsmap {
		r_int := int(r - '0') //将rune类型的数字字符转换为整数数字
		if count == 1 {
			return r_int, true //返回只出现一次的数字和true表示找到了
		}

	}
	return 0, false //如果没有找到只出现一次的数字，返回0和false
}

// 相比字典哈希表算法，使用异或运算符(XOR)空间复杂度更低
// XOR核心原理：相同的数字异或结果为0，0与任何数字异或结果为该数字本身，不同的数字异或结果为1
//
//	XOR还有一个重要性质：运算满足交换律和结合律
//	即：按下面的代码，（52542）循环连续异或，可以看作(5^5)^(2^2)^4 = 0^0^4 = 4
//
// 但下面这个函数在“不保证一定有解”的情况下有歧义，错误时无法返回“没找到只出现一次的数字”这一信息
func findSingleNumberInString_XOR(s string) (int, bool) {
	result := 0
	foundAnyDigit := false //一个标志，用于判断字符串中是否有数字
	for _, r := range s {
		if unicode.IsDigit(r) {
			foundAnyDigit = true
			// 将字符数字转换为整数数字
			// '4‘的ASCII码减去’0‘的ASCII码正好等于4
			num := int(r - '0')
			result = result ^ num
		}
	}
	if foundAnyDigit {
		return result, true
	}
	return 0, false
}

// 练习3 辅助函数：按照每行增加的样式，打印一个跳过包含数字6的九九乘法表
func printMultiplicationTable_Skip6() {
	// 外层循环控制行（第一个乘数i）
	for i := 1; i <= 9; i++ {
		// 内层循环控制列（第二个乘数j）
		for j := 1; j <= i; j++ {
			product := i * j

			//将两个乘数转换为str
			iStr := strconv.Itoa(i)
			jStr := strconv.Itoa(j)

			// 检查i,j的字符串形式中是否包含"6"
			if strings.Contains(iStr, "6") || strings.Contains(jStr, "6") {
				continue // break会终止整个内层循环，如果这儿用break,那么直接跳到下一个i了
			}

			// 使用Printf进行格式化输出
			// %-2d用于乘法结果的占位，负号表示左对齐，占位2个字符宽度，可以让结果更整齐
			// \t表示制表符，用于在式子之间产生较大的固定间距
			fmt.Printf("%dx%d=%-2d\t", j, i, product)

		}
		// 每当一行（内层循环结束），就打印一个换行符
		if i != 6 {
			fmt.Println()
		}
	}
}

// 练习4 辅助函数：找出数组和中为指定值的两个元素的下标
// 一开始的想法：暴力查找法，两层遍历所有的组合，外层0到n，内层i+1到n，如果和为指定值就把(i,j)存入索引切片中
// 但这种方法时间复杂度是O(n^2)，效率较低
// 更优的做法是使用哈希表，时间复杂度和空间复杂度都为O(n)
func findSumPairsHash(arr []int, target int) [][]int {
	// args: arr是输入的整数数组，target是目标和
	// return: 返回一个二维切片，包含所有符合条件的索引对
	var result [][]int

	// 1.创建一个map，key是数字，value是索引
	seen := make(map[int]int)

	// 2.单层循环遍历数组
	for i, num := range arr {
		// 计算需要的“另一半”
		complement := target - num

		// 在map中查找complement是否存在
		if j, found := seen[complement]; found {
			// 如果找到了，说明nums[j] + nums[i] == target
			// 我们就找到了一个解(j,i)
			result = append(result, []int{j, i})
		}

		//无论找没找到，都把当前数字和它的索引存入map，供后面元素进行查找
		seen[num] = i
	}
	return result
}

// 练习5 辅助函数 统计一个中英文混合字符串中，每个英文单词和中文汉字的出现次数
// 代码实现策略
//   1.统一的计数器：创建一个map[string]int 来存储所有结果，因为无论是单词还是汉字都可以用string表示，无需分开创建字典
//   2.单词累积器（🔛）：使用strings.Builder来高效地拼接英文字符，形成单词
//   3.逐Rune遍历：使用for _,r := range str 遍历字符串
//   4.分类处理：
//      - 如果r是汉字（unicode.IsHan):
//        - 首先，检查单词累积器(strings.Builder)中是否有内容，如果有，说明一个英文档次刚结束，需要将其存入map并清空累积器
// 	  - 将当前汉字作为string直接存入map中
// 	- 如果r是字母：
// 	  - 将这个字母rune添加到单词累积器中
// 	- 如果r是其他字符（空格，标点等）：
// 	  - 把它看作是一个“单词边界”，检查单词累积器中是否有内容，如果有，处理它并清空累积器
//  5.收尾工作：循环结束后，单词累积器中可能还留着最后一个英文单词（如果字符串以英文单词结尾），需要做一次最终的检查与处理

func countWordsAndChars(s string) map[string]int {
	// 1.使用一个map统一存储结果
	counts := make(map[string]int)

	// 2.使用strings.Builder 相比加号（s = s +"a" + "b")，更能高效累积英文单词
	var wordBuilder strings.Builder

	// 定义一个内部函数/闭包，用于处理累积器的单词，避免代码重复
	processWord := func() {
		word := wordBuilder.String()
		if word != "" { //如果单词累积器里不为空
			counts[strings.ToLower(word)]++ // 将单词转为小写，实现不区分大小写记数
			wordBuilder.Reset()             // 清空累积器

		}
	}

	// 3.逐个Rune遍历字符串并分类处理
	for _, r := range s {
		if unicode.Is(unicode.Han, r) {
			processWord()       // 遇到汉字代表单词累积结束，需要处理一下累积器里的单词了
			counts[string(r)]++ // 强制类型转换并充当字典的key

		} else if unicode.IsLetter(r) {
			wordBuilder.WriteRune(r) // 如果是字母，加入单词累积器
		} else {
			processWord() //如果是空格，标点等，视为单词边界，处理累积的英文单词
		}
	}

	processWord() // 收尾工作

	return counts
}
